Tekla Open API Reference for Tekla Structures 2025
OBB.IntersectionPointsWith Method (Line)
 Calculates the intersection points between OBB and given Line.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Point[] IntersectionPointsWith(
	Line line
)
Public Function IntersectionPointsWith (
	line As Line
) As Point()
Parameters
line
Type: Tekla.Structures.Geometry3d.Line
Line to calculate against.
Return Value
Type: Point[]
Array of intersection points.
Exceptions
Exception | Condition
ArgumentNullException | Thrown when null is assigned to the line parameter.
See Also
Reference
OBB Class
IntersectionPointsWith Overload
Tekla.Structures.Geometry3d Namespace